a = 2 #целое число
b = 3.4 #вещественное число
#Основные арефметические действия:
+ #сложение
- #вычитание
* #умножение
/ #деление
** #возведение в степень

import.math #модуль содержащий математические операции

>>> math.sqrt(9)
3.0 #извлечение квадратного корня

>>> math.cos(1)
0.5403023058681397 #косинус

>>> a=3.14
>>> round(a) #классическое округление вещественного числа
3 

>>> a=3.8939
>>> math.floor(a) #округление вещественного числа до нижнего целого числа 
3 

>>> a=19.1
>>> math.ceil(a) #окоугление вещественного числа до верхнего целого
20

>>> math.fmod(10,4) #возвращает остаток от деления 10 на 4
2.0

>>> math.isfinite(X) #является ли X числом.

>>> math.modf(a)
(0.10000000000000142, 19.0) #возвращает целую и дробную часть числа



 